import * as React from 'react';
import { Autocomplete, TextField } from '@mui/material';
import HeadsetMicIcon from '@mui/icons-material/HeadsetMic';

import { useNavigate } from "react-router-dom";

export default function AutoCompleteReader(props) {
  let quraaIds = {
    "أبو بكر الشاطري": 1,
    "أحمد الحواشي": 2,
    "أحمد الطرابلسي": 3,
    "أحمد بن على العجمى": 4,
    "أحمد صابر": 5,
    "أحمد عامر": 6,
    "أحمد محمد سلامه": 7,
    "أحمد نعينع": 8,
    "أكرم العلاقمي": 9,
    "إبراهيم الأخضر": 10,
    "ابراهيم الجرمي": 11,
    "ابراهيم الدوسري": 12,
    "إدريس أبكر": 13,
    "ابراهيم جمال القرجاوي": 14,
    "الدوكالي محمد العالم": 15,
    "الزين محمد أحمد": 16,
    "السديس والشريم": 17,
    "العشري عمران": 18,
    "العيون الكوشي": 19,
    "الفاتح محمد الزبير": 20,
    "عبدالبارئ محمد": 21,
    "عماد المنصري": 22,
    "بندر بليلة": 23,
    "توفيق الصايغ": 24,
    "جمال شاكر عبدالله": 25,
    "جمعان العصيمي": 26,
    "حسن صالح": 27,
    "حمد سنان": 28,
    "خالد الجليل": 29,
    "خالد القحطاني": 30,
    "خالد المهنا": 31,
    "خالد عبدالكافي": 32,
    "خليفة الطنيجي": 33,
    "زكي داغستاني": 34,
    "سعد الغامدي": 35,
    "سعود الشريم": 36,
    "سهل ياسين": 37,
    "سيد رمضان": 38,
    "شيرزاد عبدالرحمن طاهر": 39,
    "صابر عبدالحكم": 40,
    "صلاح بو خاطر": 41,
    "طارق عبدالغني دعوب": 42,
    "عادل الكلباني": 43,
    "عادل ريان": 44,
    "عادل مسلم": 45,
    "عبد الرحمن العوسي": 46,
    "عبد الرزاق الدليمي": 47,
    "عبد المنعم عبد المبدئ": 48,
    "عبدالبارئ الثبيتي": 49,
    "عبدالباسط عبدالصمد": 50,
    "عبدالرحمن السديس": 51,
    "عبدالرشيد صوفي": 52,
    "عبدالعزيز الأحمد": 53,
    "عبدالله الكندري": 54,
    "عبدالله المطرود": 55,
    "عبدالله بصفر": 56,
    "عبدالله خياط": 57,
    "عبدالله عواد الجهني": 58,
    "عبدالله كامل": 59,
    "عبدالمحسن الحارثي": 60,
    "عبدالمحسن العبيكان": 61,
    "عبدالمحسن القاسم": 62,
    "عبدالهادي أحمد كناكري": 63,
    "عبدالودود حنيف": 64,
    "عثمان الانداري": 65,
    "علي الحذيفي": 66,
    "علي جابر": 67,
    "علي حجاج السويسي": 68,
    "عماد زهير حافظ": 69,
    "عمر القزابري": 70,
    "فارس عباد": 71,
    "ماهر المعيقلي": 72,
    "ماهر شخاشيرو": 73,
    "محمد آل عبدالله": 74,
    "محمد البراك": 75,
    "محمد أيوب": 76,
    "محمد الأفغاني": 77,
    "محمد جبريل": 78,
    "محمد حسان": 79,
    "محمد رشاد الشريف": 80,
    "محمد صالح عالم شاه": 81,
    "محمد صديق المنشاوي": 82,
    "محمد عارف العسلي": 83,
    "محمد نورين صديق": 84,
    "محمد عبدالكريم": 85,
    "محمد محمود الطبلاوي": 86,
    "محمود الرفاعي": 87,
    "محمود الشيمي": 88,
    "محمود خليل الحصري": 89,
    "محمود علي البنا": 90,
    "مشاري بن راشد العفاسي": 91,
    "مصطفى إسماعيل": 92,
    "مصطفى اللاهوني": 93,
    "مصطفى رعد العزاوي": 94,
    "معيض الحارثي": 95,
    "مفتاح السلطني": 96,
    "موسى بلال": 97,
    "ناصر القطامي": 98,
    "نبيل الرفاعي": 99,
    "نعمة الحسان": 100,
    "هاني الرفاعي": 101,
    "وديع اليمني": 102,
    "وليد النائحي": 103,
    "ياسر الدوسري": 104,
    "ياسر القرشي": 105,
    "ياسر المزروعي": 106,
    "يوسف بن نوح أحمد": 107
  };
  
  

  const top100Films = [
    { label: "أبو بكر الشاطري" },
    { label: "أحمد الحواشي" },
    { label: "أحمد الطرابلسي" },
    { label: "أحمد بن على العجمى" },
    { label: "أحمد صابر" },
    { label: "أحمد عامر" },
    { label: "أحمد محمد سلامه" },
    { label: "أحمد نعينع" },
    { label: "أكرم العلاقمي" },
    { label: "إبراهيم الأخضر" },
    { label: "ابراهيم الجرمي" },
    { label: "ابراهيم الدوسري" },
    { label: "إدريس أبكر" },
    { label: "ابراهيم جمال القرجاوي" },
    { label: "الدوكالي محمد العالم" },
    { label: "الزين محمد أحمد" },
    { label: "السديس والشريم" },
    { label: "العشري عمران" },
    { label: "العيون الكوشي" },
    { label: "الفاتح محمد الزبير" },
    { label: "عبدالبارئ محمد" },
    { label: "عماد المنصري" },
    { label: "بندر بليلة" },
    { label: "توفيق الصايغ" },
    { label: "جمال شاكر عبدالله" },
    { label: "جمعان العصيمي" },
    { label: "حسن صالح" },
    { label: "حمد سنان" },
    { label: "خالد الجليل" },
    { label: "خالد القحطاني" },
    { label: "خالد المهنا" },
    { label: "خالد عبدالكافي" },
    { label: "خليفة الطنيجي" },
    { label: "زكي داغستاني" },
    { label: "سعد الغامدي" },
    { label: "سعود الشريم" },
    { label: "سهل ياسين" },
    { label: "سيد رمضان" },
    { label: "شيرزاد عبدالرحمن طاهر" },
    { label: "صابر عبدالحكم" },
    { label: "صلاح بو خاطر" },
    { label: "طارق عبدالغني دعوب" },
    { label: "عادل الكلباني" },
    { label: "عادل ريان" },
    { label: "عادل مسلم" },
    { label: "عبد الرحمن العوسي" },
    { label: "عبد الرزاق الدليمي" },
    { label: "عبد المنعم عبد المبدئ" },
    { label: "عبدالبارئ الثبيتي" },
    { label: "عبدالباسط عبدالصمد" },
    { label: "عبدالرحمن السديس" },
    { label: "عبدالرشيد صوفي" },
    { label: "عبدالعزيز الأحمد" },
    { label: "عبدالله الكندري" },
    { label: "عبدالله المطرود" },
    { label: "عبدالله بصفر" },
    { label: "عبدالله خياط" },
    { label: "عبدالله عواد الجهني" },
    { label: "عبدالله كامل" },
    { label: "عبدالمحسن الحارثي" },
    { label: "عبدالمحسن العبيكان" },
    { label: "عبدالمحسن القاسم" },
    { label: "عبدالهادي أحمد كناكري" },
    { label: "عبدالودود حنيف" },
    { label: "عثمان الانداري" },
    { label: "علي الحذيفي" },
    { label: "علي جابر" },
    { label: "علي حجاج السويسي" },
    { label: "عماد زهير حافظ" },
    { label: "عمر القزابري" },
    { label: "فارس عباد" },
    { label: "ماهر المعيقلي" },
    { label: "ماهر شخاشيرو" },
    { label: "محمد آل عبدالله" },
    { label: "محمد البراك" },
    { label: "محمد أيوب" },
    { label: "محمد الأفغاني" },
    { label: "محمد جبريل" },
    { label: "محمد حسان" },
    { label: "محمد رشاد الشريف" },
    { label: "محمد صالح عالم شاه" },
    { label: "محمد صديق المنشاوي" },
    { label: "محمد عارف العسلي" },
    { label: "محمد نورين صديق" },
    { label: "محمد عبدالكريم" },
    { label: "محمد محمود الطبلاوي" },
    { label: "محمود الرفاعي" },
    { label: "محمود الشيمي" },
    { label: "محمود خليل الحصري" },
    { label: "محمود علي البنا" },
    { label: "مشاري بن راشد العفاسي" },
    { label: "مصطفى إسماعيل" },
    { label: "مصطفى اللاهوني" },
    { label: "مصطفى رعد العزاوي" },
    { label: "معيض الحارثي" },
    { label: "مفتاح السلطني" },
    { label: "موسى بلال" },
    { label: "ناصر القطامي" },
    { label: "نبيل الرفاعي" },
    { label: "نعمة الحسان" },
    { label: "هاني الرفاعي" },
    { label: "وديع اليمني" },
    { label: "وليد النائحي" },
    { label: "ياسر الدوسري" },
    { label: "ياسر القرشي" },
    { label: "ياسر المزروعي" },
    { label: "يوسف بن نوح أحمد" }
  ];
  
  const navigate = useNavigate();

  function selectFun(e){
    window.scrollTo(0,0)
    let target=e.target.value;
    let id=quraaIds[target]
    if(id){
      if(props.Dir){
        navigate(`/${id- 1}/${props.Dir}`)
      }
      else
      navigate(`/${id }`)
  }
  }


  return (

    <Autocomplete
      sx={{ marginTop: '-15px',marginBottom:'15px' }}
      freeSolo
      options={top100Films.map((option) => option.label)}
      renderInput={(params) => (
        
        <TextField
          {...params}
          placeholder="أسم القارئ"
          InputProps={{
            ...params.InputProps,
            startAdornment: (
              <HeadsetMicIcon style={{ color: 'white' }} />
            ),
            style: { color: 'white' }
          }}
        />
      )}
      onSelect={selectFun}
      ListboxProps={{
        style: { background: '#27292f', color: 'white' }
      }}
      
    />
  );
}
